{
    "What events have already finished?": [
        "What events have already finished?"
    ],
    "What events have begun but has not finished?": [
        "What events have begun but has not finished?"
    ],
    "What happened after": [
        "What happened after he killed himself?",
        "What happened after the members were ousted?",
        "What happened after the failure happened?",
        "What could happen after thorny issues impede bilateral relations?",
        "What happens after the scientific calculations?",
        "What could happen after the protesting?",
        "What has stopped but could possibly resume happening after the EU and US froze the aid?",
        "What took place after talks were held?",
        "What happened after remained?",
        "What happened after he said something?",
        "What happened after the victory?",
        "What can happen after the bombing investigators made \"very good progress\" on the case?",
        "What event happened after people were holed up in a small house?",
        "What happened after a quarter-final place?",
        "What took place after the area was reportedly studded with explosives?",
        "What happened after the states were recognized?",
        "What is happening after the end of last month?",
        "What happened after the consensus?",
        "What happened after sale?",
        "What happened after the soldiers flashed the \"V\" victory sign?",
        "What does happen after the bugs emerge?",
        "What happened after the commemorate?",
        "What happened after Hasan Mahsum was identified by China as its top terrorist?",
        "What usually happens after the dollar open weakly against the Japanese yen?",
        "What happened after active?",
        "What happened after candidacy?",
        "What happened after everyone who wanted to vote was able to do so?",
        "What happened after the looting of several UN World Food Programme trucks?",
        "What happened after China signed up to other covenants?",
        "What happened after voting rules were relaxed?",
        "What happened after Communists marched?",
        "What happened after they were invited?",
        "What happened after the police believed?",
        "What happened after someone wishes?",
        "What happened after reports were made?",
        "What has happened after the sale of investments of two joint ventures?",
        "What happened after the pope's visit?",
        "What happened after instances of corporal punishment at Nike subcontracters?",
        "What happened after Hill was asked?",
        "What happened after Robyn Kilpatrick said?",
        "What happened after the protest?",
        "What likely continued to happen after the EU and US froze the aid?",
        "What happened after the attack?",
        "What event happened after the raid?",
        "What happened after the first patient was recorded?",
        "What happened after the statement?",
        "What happened after Hamas took power?",
        "What happened after the invasion?",
        "What happened after Monday?",
        "What happened after the polls on Thursday?",
        "What happened after the leaders welcomed the efforts?",
        "What happened after the press conference?",
        "What happened after Friday's offerings?",
        "What event happened after months of twists and turns?",
        "What happened after the government spoke to the lower house of parliament?",
        "What happened after he said he was responsible for fixing what went wrong?",
        "What happened after the pope was adding drama?",
        "What happened after slapping?",
        "What happened after the ministers met the negotiators?",
        "What did Elian's relatives do after he was found?",
        "What happened after IMA Holdings Corp. completed?",
        "What happened after the representatives turned up?",
        "What happened after the breakthroughs in March?",
        "What happened after Robert Scheidt was jailed?",
        "What happened after the men stood?",
        "What happened after Ramesh Thapa said?",
        "What happened after the chassis supply was built?",
        "What happened after Jiang said anything?",
        "What happened after they were injured?",
        "What happened after rally?",
        "What were the restaurants and cafes allowed to do after the fireworks?",
        "What happened after the UN made a statement?",
        "What happened after Richard self-proclaimed himself as a leader?",
        "What happened after the rally was called by the political opposition?",
        "What could happen after the summit?",
        "What happened after the offer?",
        "What happened after Iran refused to comply with the UN resolution?",
        "What happened after the security forces and guerrillas clashed?",
        "What could happen after the firing?",
        "What took place after the fire?",
        "What happened after the killings of seven local villagers 20 kilometres from Kisangani?",
        "What happened after the first death?",
        "What happened after the father was charged?",
        "What happened after the completion of the merger agreement?",
        "What happened after the Hamas-led government took over?",
        "What happened after the incident was reported?",
        "What happened after Fujimori embraced the freed hostages?",
        "What happened after they withdrew?",
        "What happened after they were toasted?",
        "What happened after the Council passed?",
        "What happened after the wife wanted something?",
        "What events occurred after the operation?",
        "What happens after the money goes somewhere?",
        "What is expected to happen after the special period?",
        "What happened after the INEC said in an official statement?",
        "What has happened after the public support?",
        "What happened after the blaze came?",
        "What happened after the separatist \"commando\" held a husband and wife hostage?",
        "What happened after the close of business?",
        "What happened after local residents attacked UN vehicles?",
        "What did the FBI chief do after touring Tanzanian capital and meeting with Kenyan police leaders?",
        "What happened after the EU and US froze the aid?",
        "What took place after the eruption?",
        "What happened after the result?",
        "What happened after the operation was ordered?",
        "What happened after the dollar opened weakly against the Japanese yen?",
        "According to the speaker, what happened after the failure happened?",
        "What did happen after they ensure?",
        "What did Soltaneh do after communicating the information?",
        "What happened after the protest on Friday?",
        "What happened after something was offered?",
        "What happened after the shares were tendered?",
        "What happened after the decline?",
        "What event should happen after Deve Gowda said something? ",
        "What happened was expected to happen after the fireworks?",
        "What happened after the report?",
        "What failed to happen after the EU and US froze the aid?",
        "What happened after Bush gave speeches?",
        "What happened after Pedro became a hostage?",
        "What happened after several villagers were killed?",
        "What would happen after a face off?",
        "What happened after goal?",
        "What did Elian's mother do after the boat sank?",
        "What should happen after the lawmakers were summoned?",
        "What happened after the report by Kenya's newspaper on Friday?",
        "What was happened after the pope assumed?",
        "What event happened after the claim?",
        "What has happened after investigators made very good progress?",
        "What happened after Ruggiero's discussion with Rockwell?",
        "What occurred after Sergei Lavrov said a meeting is planned?",
        "What would happen after China abides by all WTO rules?",
        "What happened after the nuclear test?",
        "What is likely to happen after there is a European Union that can make a real contribution to the international political and security agenda?",
        "What could happen after the meeting?",
        "What happened after the covenants covering the rights of the child and elimination of discrimination against women and the use of torture took effect?",
        "What happened after something was stable?",
        "What happened after 25 aid workers were hauled off ?",
        "What happened after the abuse China had been accused of?",
        "What happened after cigarettes were dropped or faulty wiring sparked?",
        "What has continued to happen after the spokesman spoke?",
        "What events happened after the boat sank?",
        "What is Liberia committed to do after food insecurity became an issue?",
        "What happened after the March 2003 invasion?",
        "What happens after the soldiers were due?",
        "What happened after a bid by Ciba-Geigy Ltd.?",
        "What took place after the Revolution?",
        "What happened after calm had been restored?",
        "What happened after the company stopped shipping?",
        "What happened after debris was sent across the street?",
        "What happened after import?",
        "What happened after the heavy trucks division was spared?",
        "What happened after calm was restored?",
        "What happened after the pope made a gesture?",
        "What happened after the building was marked with the Red Crescent Symbol?",
        "What happened right after the election?",
        "What happened after nonrecurring charges totaling $23.5 million and $8.2 million?",
        "What happened after the students smashed through the barriers?",
        "What happened after the remarks were made?",
        "What happened after an activist group highlighted problems?",
        "What happened after demonstrators were protesting?",
        "What did the European Union and the United States do after the Islamists formed a cabinet in March?",
        "What happened after China joined the WTO?",
        "What happened after produced?",
        "What was happening after the companies talked about the bugs?",
        "What happened after the reports?",
        "What happened after the retaliation?",
        "What would happen after they build on momentum?",
        "What happened after Schroeder's camp held positions?",
        "What happened after the Nigeria's electoral agency said?",
        "What did the spokesman do after the company's financial report was released?",
        "What happens after the Meeting takes place?",
        "What happened after the Kisangani threw stones?",
        "What are development partners hopefully going to do after food insecurity became an issue?",
        "What happened after the searching?",
        "What happened after 31 projects were registered?",
        "What happened after some can return?",
        "What happened after Hamas' election victory?",
        "What happened right after the victory?",
        "What is unlikely to happen after the refusal by the Taliban government?",
        "What happened after he was arrested?",
        "What happened after the agreement?",
        "What happened after the collapse?",
        "What happened after Casey added?",
        "What happened after it occurred?",
        "What happened after the mark broke through the technical upside resistance?",
        "What happened after magnified?",
        "What event happened after New York Stock Exchange composite trading on Wednesday?",
        "What happened after Fatah and Hamas failed to reach an agreement?",
        "What happened after the border issue?",
        "What happened after the massacre?",
        "What happened after reporting every two years on the situation?",
        "What happened after Stuttgarter Zeitung made a statement?",
        "What happened after the talks?",
        "What happened after the resistance?",
        "What happened after the drive had technical problems?",
        "What happened after the earthquake struck?",
        "What happened after the visit?",
        "What happened after it can round?",
        "What is nearly certain to happen after the warning was issued?",
        "What happened after the PM was reduced to a laughing stock?",
        "What events took place after there were movements?",
        "What failed to happen after the election?",
        "What happened after Prakash added?",
        "What occurred after the scientists were killed?",
        "What occurred after the IEA said its statement?",
        "What happened after the promise was fulfilled?",
        "What happened after anticipation?",
        "What happened after some fires were deliberately set?",
        "What happened after he gave out the bouquets?",
        "What happened after the hurricane?",
        "What took place after the Jordanian Foreign Minister spoke?",
        "What happened after the murder?",
        "What happened after Bush gave four key speeches?",
        "What happened after the acquisition?",
        "What is happening after Saturday?",
        "What happened after the anticipation?",
        "What happened after the accord?",
        "What happened after the initial problems?",
        "What could have happened after the fighting of the LRA?",
        "What would begin happening after China's accession?",
        "What happened after the 45-minute long clash?",
        "What happened after Operation Winter Race was designed?",
        "What should happen after expressed?",
        "What happened after the decision was made?",
        "What happened after Fujimori arrived?",
        "What happened after the jubilant soldiers appeared on the rooftop?",
        "What has happened after the Palestinian president and the ruling Islamists tried to form a coalition?",
        "What happened after the food was provided?",
        "What happened after the 787 Dreamliner proved popular with airlines?",
        "What happened after they won a bronze medal?",
        "What happened after the report by Murdock?",
        "What happened after the states made efforts to prepare themselves for membership?",
        "What happened after the success?",
        "What happened after riot police deployed in Lagos?",
        "What failed to happen after the victory?",
        "What happened after Ciba-Giegy and Chiron spoke?",
        "What happened after the cut-off?",
        "What happened after they wash?",
        "What happened after the election?",
        "What happened after Al-Arabiya reported?",
        "What event happened after a bomb exploded?",
        "What happened after the purchasing of shares?",
        "What happened after China undertook something?",
        "What happened after the bomb attacks took place?",
        "What happened after the attack on the UN vehicles?",
        "What has happened after Iran was authorized by IAEA?"
    ],
    "What happened before": [
        "What happened before the 45-minute long clash?",
        "What happened before the turbulence in the region?",
        "What happened before they were injured?",
        "What happened before the election victory?",
        "What happened before regulatory approvals and shares being tendered occurs?",
        "What happened before the company stopped shipping?",
        "What happened before delivering any EU support?",
        "What was happening before Saturday?",
        "What happened before the talks?",
        "What happened before an activist group highlighted problems?",
        "What happened before the rally was called by the political opposition?",
        "What happened before New York Stock Exchange composite trading on Wednesday?",
        "What happened before the resistance?",
        "What happened before goal?",
        "What happened before the softening?",
        "What happened before the operation was ordered?",
        "What happened before any US urging?",
        "What happened before Fujimori toured the residence?",
        "What happened before the forces clashed?",
        "What happened before the refusal by the Taliban government?",
        "What was happened before the pope assumed?",
        "What happened before said?",
        "What happened before cigarettes were dropped or faulty wiring sparked?",
        "What events took place before the scientists were killed?",
        "What did the FBI chief do before he said he is very satisfied with the cooperation among the FBI agents and the  police in Kenya and Tanzania?",
        "What should happen before the European Union and the United States resume direct aid to the Palestinian government?",
        "What happened before the purchasing of shares?",
        "What happened before produced?",
        "What has happened before Wagner said anything?",
        "What happened before he killed himself?",
        "What has happened before the public support?",
        "What happened before the Balkan states were recognized?",
        "What happened before demonstrators were protesting?",
        "What did people do before joining the celebration?",
        "What has happened before the $2 million gain?",
        "What happened before the Revolution?",
        "What happened before the states made efforts to prepare themselves for membership?",
        "What happened before the initial problems?",
        "What happened before the chassis supply was built?",
        "What did Wolfgang Niersbach do before Friday's draw?",
        "What happened before the wife wanted something?",
        "What had to happen before the annual resolution?",
        "What happened before Niersbach spoke about the managers?",
        "What happened before the Council passed?",
        "What has to happen before the machines reach the market?",
        "What happens before the programs are affected?",
        "What happened before investors were encouraged to accelerate buying?",
        "What happened before he was arrested?",
        "What took place before the Indian retaliated?",
        "What happened before the vote?",
        "What happened before the remarks were made?",
        "What happened before Niersbach revealed information?",
        "What happened before Ciba-Giegy and Chiron spoke?",
        "What happened before the jubilant soldiers appeared on the rooftop?",
        "What happened before debris was sent across the street?",
        "What happened before the convoy reached the checkpoint?",
        "What happened before they made the comment on obliging Beijing?",
        "What happened before Casey added?",
        "What had to happen before China would by all WTO rules?",
        "What happened before the first death?",
        "What happened before the success?",
        "What happened before the dollar opened weakly against the Japanese yen?",
        "What must happen before ascension?",
        "What happened before 31 projects were registered?",
        "What happened before the abuse China had been accused of?",
        "What happened before obliging Beijing?",
        "What reportedly happened before authorities spent hours retrieving documents?",
        "What happened before the report?",
        "What happened before 25 aid workers were hauled off ?",
        "What happened before the border issue?",
        "What happened before the Nigeria's electoral agency said?",
        "What happened before Grandi said anything?",
        "What happened before the session?",
        "What happened before Hill was asked?",
        "What happened before the pope was adding drama?",
        "What happened before the IBM spokeswoman said something?",
        "What events took place before the narrator knows about the 1200 dishes?",
        "What happened before Fatah and Hamas failed to reach an agreement?",
        "What happened before IMA Holdings Corp. completed?",
        "What happened before described?",
        "What happened before the couple was exchanged for Scheidt?",
        "What happened before the agreement?",
        "What took place before the fire?",
        "What happened before phasing out?",
        "What happened before the end of last month?",
        "What happened before that they are witnessing?",
        "What happened before there were breakthroughs?",
        "What happened before they were invited?",
        "What happened before Jiang said anything?",
        "What happened before the statement?",
        "What happened before they met?",
        "What happened before offset?",
        "What happened before IBM announced that they have no plans to recall add-on cards?",
        "What happened before the list was compiled?",
        "What happened before a U-turn?",
        "What happened before the earthquake struck?",
        "What happened before something was offered?",
        "What happened before the mediators withdrew?",
        "What took place before the operation?",
        "What happened before the job cuts?",
        "What happened before the months of twists and turns?",
        "What happened before calm was restored?",
        "What happened before the polls on Thursday?",
        "What happened before the killings of seven local villagers 20 kilometres from Kisangani?",
        "What happened before Buckovski opened a large bottle of champagne?",
        "What happened right before Hamas took power?",
        "What happened before Kobe's reign?",
        "What happened before the terrorist facilities were raided by the U.S.?",
        "What has happened before Soltaneih said the things  he communicated?",
        "What happened before the bomb attacks took place?",
        "What happened before the visit?",
        "What happened before they won a bronze medal?",
        "What happened before Communists marched?",
        "What took place before the injured were evacuated?",
        "What happened before the commemorate?",
        "What happened before the result?",
        "What happened before instances of corporal punishment at Nike subcontracters?",
        "What happened before the injured were treated?",
        "What happened before the blaze came?",
        "What happened before the narrator talked to the catering service?",
        "What happened before Fujimori arrived?",
        "What happened before Iraqis went to the polls?",
        "What event happened before operations had a loss of $5.5 million for the quarter?",
        "What happened before revenue declined?",
        "What happened before the shares were tendered?",
        "What happened before the anticipation?",
        "What happened before the students smashed through the barriers?",
        "What is likely to happen before there is a European Union that can make a real contribution to the international political and security agenda?",
        "What happened before the Airbus A350 XWB was designed to compete with Boeing?",
        "What happened before the protest?",
        "What definitely happened before the failure happened?",
        "What happened before the breakthroughs in March?",
        "What has happened before Iran was authorized by IAEA?",
        "What happened before Pedro became a hostage?",
        "What happened before riot police deployed in Lagos?",
        "What happened before analysts spoke?",
        "What needs to happen before the offers are approved?",
        "What happened before the UN made a statement?",
        "What event happened before the completion of the merger agreement?",
        "What happened before it can round?",
        "What happened before the pope made a gesture?",
        "What happened before the nuclear test?",
        "What happened before the spokesperson said something?",
        "What happened before the president said something?",
        "What happened before the meeting on Thursday?",
        "What happened before the election of the 275 MPs?",
        "What happened before the IEA's forecast?",
        "What happened before the members were ousted?",
        "What had to happen before they could build on momentum?",
        "What would the West do before Larijani would employ painful measures back against the West?",
        "What did Soltaneh do before communicating the information?",
        "What happened before additional support was needed?",
        "What happened before Ramesh Thapa said?",
        "What happened before the troops were deployed?",
        "What happened right before the election?",
        "What happened before something was stable?",
        "What happened before the lawmakers were summoned?",
        "What happened right before the victory?",
        "What has to happen before the spiraling crisis could end?",
        "What happened before the leaders welcomed the efforts?",
        "What happened before the supply has been built?",
        "What happened before Meriuex submits details of it proposed investments?",
        "What happened before the searching?",
        "What took place before the area was reportedly studded with explosives?",
        "What happened before Rockwell's statement?",
        "What could happen before Centrifuge machines are protected?",
        "What happened before Murdock reports?",
        "What happened before the scientists sampled the gases?",
        "What has happened before nonrecurring charges totaling $23.5 million and $8.2 million were incurred?",
        "What took place before the merchants were delighted?",
        "What happened before China joined the WTO?",
        "What happened before the father was charged?",
        "What happened before Friday's draw?",
        "What happened before a quarter-final place?",
        "What happened before Robyn Kilpatrick said?",
        "What happens before he says anything?",
        "What happened before the heads of donkeys were sacrificed?",
        "What happened before they were toasted?",
        "What happened before the special period?",
        "What happened before the cut-off?",
        "What happened before the hurricane?",
        "What happened before reports were made?",
        "What happened before several villagers were killed?",
        "What happened before China undertook something?",
        "What happened before he said he was responsible for fixing what went wrong?",
        "What happened before the men stood?",
        "What happened before rally?",
        "What happened before Bush gave four key speeches?",
        "What happened before magnified?",
        "What happened before supporters of the military leader gathered in the north?",
        "What happened before the retaliation?",
        "What happened before they hope?",
        "What had happened before the close of business Thursday?",
        "What happens before President Hu pays at least one visit?",
        "What happened before some can return?",
        "What happened before Mr. Slate said something?",
        "What happened before everyone who wanted to vote was able to do so?",
        "What has happened before coaches witness the draw?",
        "What happens before the money goes somewhere?",
        "What happened before the raid in Pakistan's South Waziristan tribal region?",
        "What happened before the acquisition?",
        "What happened before the murder?",
        "What would happen before a test?",
        "What happened before Operation Winter Race was designed?",
        "What  happened before sale?",
        "What happened before Ruggiero's discussion with Rockwell?",
        "What happened before the close of business?",
        "What happened before the massacre?",
        "What happened before Benson flew to Vietnam?",
        "What happened before the report by Kenya's newspaper on Friday?",
        "What has happened before the draw?",
        "What happened right before the EU and US froze the aid?",
        "What happened before voting rules were relaxed?",
        "What happened before 3.5 million people were affected?",
        "What happened before the 787 Dreamliner proved popular with airlines?",
        "What is happening before there is a European government with the diplomatic skills to deliver EU support?",
        "What happened before the pope's visit?",
        "What happened before the promise was fulfilled?",
        "What happened before the security forces and guerrillas clashed?",
        "What happened before Kilpatrick cautioned about China's behavior?",
        "What happens before the Meeting takes place?",
        "What happened before Bush gave speeches?",
        "What has happened before the managers are in Leipzig?",
        "What happened before the decision was made?",
        "What happened before the negotiation?",
        "What happened before local residents attacked UN vehicles?",
        "What happened before the covenants covering the rights of the child and elimination of discrimination against women and the use of torture took effect?",
        "What happened before North Korea pulled out of talks?",
        "What happened before calm had been restored?",
        "What happened before anything was recorded?",
        "What must happen before the outcome?",
        "What happened before Schroeder's camp held positions?",
        "What happened before China signed up to other covenants?",
        "What happened before the mark broke?",
        "What happened before the offer?",
        "What took place before authorities spent hours retrieving documents?",
        "What happened before food was provided?",
        "What happened before they went to Iraq?",
        "What was happening before the talks?",
        "What happened before the March 2003 invasion?",
        "What happened before the attack on the UN vehicles?",
        "What happened before the accord?",
        "What happened before Friday's offerings?",
        "What happened before the press conference?",
        "What happened before the speaker added something?",
        "What happened before the general elections?",
        "What happened before the INEC said in an official statement?",
        "What took place before the Jordanian Foreign Minister spoke?",
        "What happened before the drive?",
        "What did Elian do before he was found?",
        "What happened before the New York Times said something?",
        "What event happened before the decline of Intel's stock?",
        "What happened before Iran refused to comply with the UN resolution?",
        "What happened before Saturday?",
        "What happened before the organizers made a statement?",
        "What happened before the incident was reported?",
        "What happened before expressed?",
        "What happened before Prakash added?",
        "What happened before the looting of several UN World Food Programme trucks?",
        "What took place before talks were held?",
        "What happened before that they are now seeing?",
        "What happened before Wei chose?",
        "What happened before they wash?",
        "What happened before the report by Murdock?"
    ],
    "What might happen during": [
        "What may happen after he said something?",
        "What might happen after the report by Murdock?",
        "What might be happening during negotiations?",
        "What might happen after European countries look at relations?",
        "What might happen after the heads of donkeys were sacrificed?",
        "What might have happened before Richard self-proclaimed himself as a leader?",
        "What may happen after candidacy?",
        "What may happen after something is bought?",
        "What event might have happened before the claim?",
        "What might happen after the IBM spokeswoman said something?",
        "What might happen after Kobe's reign?",
        "What might happen after Ruggiero's discussion with Rockwell?",
        "What might continue after an official made the allegation?",
        "What might happen before Prakash added?",
        "What might happen after the threats?",
        "What might happen after the last eruption?",
        "What may happen after the job cuts?",
        "What may happen in the future?",
        "What might happen after the Council passed a resolution?",
        "What might occur after the Indian retaliated?",
        "What might happen after the Nigeria's electoral agency said?",
        "What might happen after Wagner said something?",
        "What might not happen after something is said?",
        "What may happen after the microprocessor is the spearhead?",
        "What might happen during the see?",
        "What might happen after practical measure were recommended?",
        "What should have been finished by the election but might not?",
        "What might happen after Kisangani was taken?",
        "What may happen after they allow?",
        "What might happen in the future?",
        "What might happen after they ensure?",
        "What might happen while the Americans say hurry up?",
        "What might happen in the future, after riot police were deployed in Lagos?",
        "What may happen after he said?",
        "What might happen after the rally began?",
        "What might happen after remained?",
        "What may happen after the breakthroughs in March?",
        "What may happen after Meriuex submits details of it proposed investments?",
        "What may happen after regulatory approvals and shares being tendered occurs?",
        "What might have started before the reports?",
        "What may happen after this approach fails?",
        "What might happen after the group agrees on sanctions?",
        "What might happen during the meeting on Thursday?",
        "What may happen after they hope?",
        "What might happen after the Americans say hurry up?",
        "What might occur before the best solution?",
        "What might have happened before an official made the allegation?",
        "What might happen after Rockwell's statement?",
        "What may happen before something is bought?",
        "What should have been finished by the poll but might not?",
        "What may happen while something is bought?",
        "What might happen after obliging Beijing?",
        "What might have happened before said?",
        "What may not happen before this approach fails?",
        "What might happen after they base their machines on the chips?",
        "What may happen again in the future?",
        "What event might have happened before people were holed up in a small house?",
        "What might not happen before something is said?",
        "What may happen after US urging?",
        "What may happen after a face off?",
        "What might happen during the like?",
        "What may happen after appeals?",
        "What might occur after the narrator knows about the 1200 dishes?",
        "What might have happened before the police believed?",
        "What might happen after Robyn Kilpatrick said?",
        "What may happen after someone wants?",
        "What may happen after someone wishes?",
        "What may happen before this approach fails?",
        "What may happen after analysts speak?",
        "What might have started after the reports?",
        "What might have happened in the past?",
        "What might have happened as a result of concern about the chip?",
        "What might happen during the happen?",
        "What might happen after the border issue?",
        "What event might happen after Deve Gowda said something? ",
        "What might happen after the company stops shipping?",
        "What might have happened before the reports?",
        "What might happen after the Palestinian government renounces violence and recognizes Israel and past peace deals?",
        "What may happen after the rally?",
        "What event might have already started before Hill responded?",
        "What might happen after Prakash added?",
        "What may happen after the protest?"
    ],
    "What will happen": [
        "What will happen after President Hu pays at least one visit?",
        "What will happen after two hostages were seriously injured?",
        "What will happen after a spokesman said something?",
        "What will happen before Oscars?",
        "What will happen at the same time a UN resolution on Iran's nuclear programme is discussed?",
        "What will happen after he was arrested?",
        "What will happen while the managers are in Leipzig?",
        "What will happen after the narrator talked to the catering service?",
        "What will happen during the march, according to President Lahoud?",
        "What will definitely happen after the decision was made?",
        "What will likely happen after the breakthroughs?",
        "What will happen after the lawmakers were summoned?",
        "What will the FBI chief do after he said he is very satisfied with the cooperation among the FBI agents and the  police in Kenya and Tanzania?",
        "What will happen after the draw?",
        "What will likely occur after the construction?",
        "What will happen after investments can be made?",
        "What will happen after the election of the 275 MPs?",
        "What will happen after described?",
        "What will still be happening while terrorism is fought?",
        "What will probably occur after the onset of winter?",
        "What will happen after father's charge?",
        "What will happen eventually?",
        "What does the WTO director general hope will happen after the success in March?",
        "What will happen after the rally?",
        "What will have finished before a bilateral agreement?",
        "What will happen before the managers are in Leipzig?",
        "What will happen after Oscars?",
        "What will definitely happen after the dialogue began?",
        "What will happen during the general elections?",
        "What will happen after Niersbach spoke about the managers?",
        "What happened before the global demand for oil will rise?",
        "What will start after the press conference attended by Wolfgang Niersbach?",
        "What will take place now that talks were held?",
        "What will happen in the future, after the Airbus A350 XWB has been designed to compete with Boeing?",
        "What will happen after the global demand for oil rises?",
        "What will happen after ascension?",
        "What will have happened before arbitration?",
        "What will happen during the meeting of the UN Security Council?",
        "What will be completed after the refusal by the Taliban government?",
        "What will happen after Yanfeng's announcement?",
        "What will happen after coaches witness the draw?",
        "What will happen after a U-turn?",
        "What will happen at the same time as stepping up?",
        "What will happen after the drive?",
        "What will happen after the treatment?",
        "What will begin before the draw?",
        "What will happen after the session?",
        "What will happen after he said?",
        "What will happen after the resistance?",
        "What will happen in the future?",
        "What will happen after the chassis supply was built?",
        "What will happen after Niersbach revealed information?",
        "What event will begin after Lavrov was quoted? ",
        "What will happen after the IEA's forecast?",
        "What will happen while coaches witness the draw?",
        "What will happen before the developing takes place?",
        "What will probably happen after Buckovski open a large bottle of champagne?",
        "What will happen after the press conference?",
        "What will happen during cope?",
        "What will happen after they hope?",
        "What will happen after the phasing out?",
        "What will happen after the machines reach the market?",
        "What happened or will happen before the Prius will be available?",
        "What will the bombing investigators do after they made \"very good progress\" on the case?",
        "What will happen after the offers are approved?",
        "What will happen after there is a European government with the diplomatic skills to deliver EU support?",
        "What will happen during the draw?",
        "What will likely happen after additional support was given?",
        "What will happen before coaches witness the draw?",
        "What will happen before the draw?",
        "What will definitely happen after the failure happened?",
        "What will likely happen in the future after 3.5 million people were affected?",
        "What will happen after they ensure?",
        "What will happen after the list was compiled?",
        "What will have begun before a bilateral agreement?",
        "What will happen after Iraqis went to the polls?",
        "What event will start after the meeting of the UN Security Council?",
        "What will begin before coaches witness the draw?",
        "What will happen after 25 aid workers are hauled off ?",
        "What will happen after delivering EU support?",
        "What will probably happen before the group agrees on sanctions?",
        "What will happen after committed?",
        "What will definitely happen after the speaker added something?",
        "What will happen after the president said something?",
        "What will happen after they met?",
        "What will have happened before being settled by an international court?",
        "What will happen after Saturday?",
        "What will happen after Casey added?",
        "What happened or will happen after offset?",
        "What will happen after the 275 MPs are elected?"
    ],
    "What happened during": [
        "What was happening while he was preparing the paperwork?",
        "What happened when reports were made?",
        "What is happening while Tamils are living in Sri Lanka?",
        "What is happening while the Tamil Tigers have been fighting?",
        "What has happened during the public support?",
        "What is happening while the Tamil Tigers are accusing?",
        "What happened while Kilpatrick was cautioning about China's behavior?",
        "What happened during the border issue?",
        "What happened during the massacre?",
        "What happened during the polls on Thursday?",
        "What is happening while the microprocessor is the spearhead?",
        "What was happening while the mark was at 3.3673 French francs from 3.3681?",
        "What happened during Ramesh Thapa said?",
        "What was happening while the mark was at 84.60 pesetas from 84.69?",
        "What happened during the attack on the UN vehicles?",
        "What happened while supporters of the military leader gathered in the north?",
        "What happened while some fires were deliberately set?",
        "What was happening while the mark was at 73.42 yen from 73.48?",
        "What was happening while Sterling was 9.2559 French francs from 9.2779?",
        "What was happening while Sterling was 201.84 yen from 2202.11?",
        "What was happening while the separatist \"commando\" held a husband and wife hostage?",
        "What happened when there was a negotiation?",
        "What happened while the men stood?",
        "What happened during Ruggiero's discussion with Rockwell?",
        "What was happening while uranium was being enriched?",
        "What was happening while the pope assumed?",
        "What happened during the incident was reported?",
        "What happened during the March 2003 invasion?",
        "What happened while the gang was in their uniforms?",
        "What happened while the members were ousted?",
        "What happened when the couple was exchanged for Scheidt?",
        "What failed to happen during the talks?",
        "What is happening while the Sinhalese population are discriminating?",
        "What was happening while the mark was at 0.8608 Swiss francs from 0.8629?",
        "What happened during the pope's visit?",
        "What was happening during the gas sampling?",
        "What happened during goal?",
        "What happened when the US made a demand?",
        "What was happening while the mark was at 992.0 lire from 998.0?",
        "What happened during the eruption?",
        "What was happening during the meeting?",
        "What was happening while the UN made a statement?",
        "What happens during the time bugs emerge",
        "What happened during active?",
        "What happened during described?",
        "What happened while the spokesperson said something?",
        "What happened while the pope was adding drama?",
        "What happened during the protest on Friday?",
        "What happened while he killed himself?",
        "What happened during the press conference?",
        "What happened during the security forces and guerrillas clashed?",
        "What happened during sale?",
        "What event happened when operations had a loss of $5.5 million for the quarter?",
        "What is happening during the offer?",
        "What was happening while Paul Harris spoke, according to him?",
        "What happened during instances of corporal punishment at Nike subcontracters?",
        "What happened while voting rules were relaxed?",
        "What event happened when the loss was magnified?",
        "What event happened during the raid?",
        "What happened during the drive?",
        "What happened when the jubilant soldiers appeared on the rooftop?",
        "What happened during the raid in Pakistan's South Waziristan tribal region?",
        "What is happening while the shares were tendered?",
        "What happened while Jiang was saying anything?",
        "What happened during the annual resolution?",
        "What was happening while the pope made a gesture?",
        "What was happening when the police believed?",
        "What was happening while calm was restored?",
        "What doesn't happen while Schroeder's camp holds positions?",
        "What happened while the convoy reached the checkpoint?",
        "What happened during the 45-minute long clash?",
        "What is expected to happen during the special period?",
        "What was happening while Sterling was at 2.7492 marks from 2.7544?",
        "What happened while riot police deployed in Lagos?",
        "What events happened during their travel?",
        "What happened during offset?",
        "What happened during expressed?",
        "What was happening while Sterling was at 1.6445 dollars from 1.6495?",
        "What happened during the visit?",
        "What happened while cigarettes were dropped or faulty wiring sparked?",
        "What happened when Hamas won something?",
        "What was happening during the sacrifice of donkeys' heads?",
        "What was happening while Sterling was 2.3643 Swiss francs from 2.3745?",
        "What happened during the discharge of gas?",
        "What happened during the talks?",
        "What is happening when Kisangani was taken?",
        "According to the speaker, what happened when the decision was made?",
        "What was happening while he was reforming intelligence capabilities?",
        "What happened while the government spoke to the lower house of parliament?",
        "What happened when the decision was made?",
        "What happened during the commemorate?",
        "What happened during the rally?",
        "What happened while the organizers made a statement?",
        "What happened while everyone who wanted to vote was able to do so?",
        "What was happening during the IEA's forecast?",
        "What occurred while the IEA said its statement?",
        "What does happen while the bugs emerge?",
        "What is happening during the retaliation?",
        "What also happened during the threats?",
        "What happened during the time that food was provided?",
        "What happened while North Korea pulled out of talks?",
        "What happened during the summit?",
        "What did happen during negotiations?",
        "What happened while IBM announced that they have no plans to recall add-on cards?",
        "What happened during magnified?",
        "What happened during the Revolution?",
        "What event happened when people were holed up in a small house?",
        "What happened when 31 projects were registered?",
        "What happened during produced?"
    ],
    "What began": [
        "What started before he said?",
        "What began before the construction?",
        "What continued to occur while China started to grant individual firms import-export rights?",
        "What started before a spokesman said something?",
        "What started after the scientists descended?",
        "What is likely to occur after China started to grant individual firms import-export rights?",
        "What happened after he began preparing the paperwork?",
        "According to the speaker, what began happening before the speaker added something?",
        "What events started before he said something?",
        "What began after the earthquake struck and is still ongoing?",
        "What started prior to investigators making very good progress?",
        "What started before tally?",
        "What started before they allow?",
        "What started happening before the talks?",
        "What began after Benson flew to Vietnam?",
        "What began before Nike started having production managers in Vietnam?",
        "What happened once talks started being held?",
        "What began after Hasan Mahsum was identified by China as its top terrorist?",
        "What event has started after Deve Gowda said something? ",
        "What finished after Islamabad began helping Beijing?",
        "What occurred after refinery and crude capacity began returning?",
        "What events started before the police believed?",
        "What started before the government spoke to the lower house of parliament?",
        "What began before an activist group highlighted problems?",
        "What event had started before 25 aid workers were hauled off ?",
        "What began after the merchants were delighted?",
        "What started before the threat was perceived?",
        "What started before the refusal by the Taliban government?",
        "What started before when the US made a demand?",
        "What began before the raid in Pakistan's South Waziristan tribal region?",
        "What began before the onset of winter?",
        "What began to happen after the gas started to accumulate?",
        "What events started after the narrator talked to the catering service?",
        "What began before the exercise?",
        "What happened after a plant started developing?",
        "What had started before the Palestinian president and the ruling Islamists tried to form a coalition?",
        "What happened before he began preparing the paperwork?",
        "According to the speaker, what began happening after the dialogue began?",
        "What started after voting rules were relaxed?",
        "What started before someone wants?",
        "What began before Robert Scheidt was jailed?",
        "What started after they went to Iraq?",
        "What started before he said something?",
        "What began after the raid in Pakistan's South Waziristan tribal region?",
        "What events started before practical measure were recommended?",
        "What event began before the representatives turned up?",
        "What started before a U-turn?",
        "According to the speaker, what started happening before the decision was made?",
        "What started after the New York Times said something?",
        "What started after uranium was being enriched?",
        "What started happening before the Jordanian Foreign Minister spoke?",
        "What happened before the rally began?",
        "What happened before the development started.",
        "What event started before an official made the allegation?",
        "What event started before two hostages were seriously injured?",
        "What began before there were breakthroughs?",
        "What events had started before the FBI chief toured the Tanzanian capital?",
        "What occured before China started to grant individual firms import-export rights?",
        "What definitely happened after the dialogue began?",
        "What started before the reports?",
        "What began before Benson flew to Vietnam?",
        "What should happen after a plant started developing?",
        "What happened befure the EU and US started giving aid to the Palestinian Authority?",
        "What began after 3.5 million people were affected?",
        "What started before there were movements?",
        "What started before the consensus?",
        "According to Lahoud, what started before he made a statement to the London Daily?",
        "What started after the violation of work regulations?",
        "According to the speaker, what happened after the dialogue began?",
        "What started after the threat was perceived?",
        "What event has likely started since Hill responded?",
        "What  occured before the cooperation began among the FBI agents and police?",
        "What started during the time when the rally was broken up?",
        "What happened after the gathering started?",
        "What started before the father was charged?",
        "What started before the rally was broken up?",
        "What began before Ruggiero's discussion with Rockwell?",
        "What began before Niersbach revealed information?",
        "According to the speaker, what started happening before the failure happened?",
        "What started happening before Casey added?",
        "What began during anonymity?",
        "What began before Niersbach spoke about the managers?",
        "What happened after the operation began?",
        "What began before Rockwell's statement?",
        "What event began before a colleague was quoted?",
        "What started the bugs to emerge?",
        "What had started before the separatist \"commando\" held a husband and wife hostage?",
        "According to the speaker, what began happening before the dialogue began?",
        "What happened before Islamabad began helping Beijing?",
        "What happened after suppressors began?",
        "What event began before two dozen people were slightly hurt?",
        "What began during the exercise?",
        "What started after tally?",
        "What started after the break without finishing?",
        "What started before authorities spent hours retrieving documents?",
        "What started after Wei was left alone?",
        "What events began before the eruption?",
        "What started before the meeting?",
        "What began to happen before the discharge of gas?",
        "What happened before Nike started having production managers in Vietnam?",
        "What ended before he started reforming intelligence capabilities?",
        "What started the expectation?",
        "What happened after the EU and US started giving aid to the Palestinian Authority?",
        "What began before the protest on Friday?",
        "What began the phasing out?",
        "What happened before 31 projects began?",
        "What happened before the operation began?",
        "What happened after the rally began?",
        "What happened after Nike started having production managers in Vietnam?",
        "What events started before they were traveling?",
        "What began after the narrator knows about the 1200 dishes?",
        "What event ended before the raid began?",
        "What happened after 31 projects began?",
        "What started before something was stable?",
        "What began after anonymity?",
        "What happened before the dialogue began?",
        "What started before a bid by Ciba-Geigy Ltd.?",
        "What event has started?",
        "What began before Islamabad began helping Beijing?",
        "What failed to happen after the EU and US started giving aid to the Palestinian Authority?"
    ],
    "finished": [
        "What finished after Wei chose?",
        "What happened before finished?",
        "What finished before the US made a demand?",
        "What happened after finished?",
        "What event ended before Deve Gowda said something? ",
        "What happened after negotiations ended?",
        "What occurred before the scientists descended?",
        "What happened during the press conference attended by Wolfgang Niersbach?",
        "What ended after the couple was exchanged for Scheidt?",
        "What finished after North Korea pulled out of talks?",
        "What finished before the soldiers were due?",
        "What ended before bagged?",
        "What event ended before Al-Arabiya reported?",
        "What happened during finished?",
        "What event ended after Lavrov was quoted? ",
        "What took place after the bid would be extended?",
        "What ended while Robert Scheidt was jailed?",
        "What would happen after the bid would be extended?",
        "What event has finished after Hill responded?",
        "What happened before negotiations ended?",
        "What event finished before Hill responded?",
        "What finished during the ceremony?"
    ],
    "happened since": [
        "What happened since Kobe's reign?",
        "What happened since the close of business Thursday?",
        "What has happened since the annual resolution?",
        "What has happened since the attack?",
        "What has happened since a colleague was quoted?",
        "What has happened since the troops were deployed?"
    ],
    "not": [
        "What did not happen after the blaze came?",
        "What happened after people not on electoral lists voted?",
        "What could happen after Museveni would not stand in the way?",
        "What will not happen during the march, according to President Lahoud?",
        "What will happen during the note?",
        "What did not happen after debris was sent across the street?",
        "What happened before Ramesh Thapa said but has not finished?",
        "What does not happen after the bugs emerge?",
        "What happened before he said the errata do not affect the programs?",
        "What did Blair not believe happened after the invasion?",
        "What didn't happen before the spokesman spoke?",
        "What events have not started before he said something?",
        "What is happening while the bugs are not at all uncommon?",
        "What is not likely to happen after call?",
        "What has *not* happened after the failure happened?",
        "What could people not on the electoral lists do once they had an identity card?",
        "What happened before the general elections but has not finished?",
        "What happened after the security forces and guerrillas clashed but has not finished?",
        "According to Lahoud, what did not happen before he made a statement to the London Daily?",
        "What does not happen during the time bugs emerge",
        "What happened before the security forces and guerrillas clashed but has not finished?",
        "What happened during the security forces and guerrillas clashed but has not finished?",
        "What happened before the Nigeria's electoral agency said but has not finished?",
        "What happened after the bugs are not at all uncommon?",
        "What happened before the purchasing of shares but has not finished?",
        "What happened after the incident was reported but has not finished?",
        "What could people not on the electoral lists do while they had an identity card?",
        "What has *not* happened before the speaker added something?",
        "What happened during the incident was reported but has not finished?",
        "What has not happened after investigators made very good progress?",
        "What happened during the 45-minute long clash but has not finished?",
        "What happened before the acquisition but has not finished?",
        "What has *not* happened after the dialogue began?",
        "What did not happen before some can return?",
        "What had to happen so people not on electoral lists could vote?",
        "What happened before the 45-minute long clash but has not finished?",
        "What was not happening before the talks?",
        "What probably will not happen after the US made a demand?",
        "What did the restaurants and cafes not have to do after the fireworks?",
        "What didn't happen after the companies talked about the bugs?",
        "What did Blair not believe happened before the invasion?",
        "What cannot happen even after the bombing investigators made \"very good progress\" on the case?",
        "What didn't happen while uranium was being enriched?",
        "What could people not on the electoral lists do before they had an identity card?",
        "What will probably not happen after Buckovski open a large bottle of champagne?",
        "What happened after Ramesh Thapa said but has not finished?",
        "What did not happen during negotiations?",
        "What happened before the incident was reported but has not finished?",
        "What didn't happen during the development.",
        "What happened before IMA Holdings Corp. completed but has not finished?"
    ]
}